{
    "task": "S3 Data Ingestion",
    "json_input": [
      {"text": "El fútbol es el deporte más popular del mundo, jugado por dos equipos de once jugadores en un campo rectangular con porterías en cada extremo.", "label": 0},
      {"text": "El objetivo es anotar más goles que el equipo contrario, impulsando un balón dentro de la portería rival.", "label": 0},
      {"text": "Reglas del Fútbol: Un partido se divide en dos tiempos de 45 minutos cada uno, con un descanso de 15 minutos entre ambos.", "label": 1},
      {"text": "Solo el portero puede usar las manos y solo dentro del área de gol.", "label": 1},
      {"text": "Un gol se anota cuando el balón cruza completamente la línea de gol entre los postes y bajo el travesaño.", "label": 1},
      {"text": "Jugadores Famosos de Fútbol: Lionel Messi: Argentino, considerado uno de los mejores jugadores de todos los tiempos.", "label": 2},
      {"text": "Cristiano Ronaldo: Portugués, conocido por su habilidad goleadora y su físico imponente.", "label": 2},
      {"text": "Pelé: Brasileño, considerado una leyenda del fútbol, con tres Copas del Mundo ganadas.", "label": 2},
      {"text": "Eventos Importantes de Fútbol: Copa Mundial de la FIFA: El torneo más prestigioso, celebrado cada cuatro años.", "label": 3},
      {"text": "Liga de Campeones de la UEFA: Torneo anual entre los mejores clubes de Europa.", "label": 3},
      {"text": "Copa América: Campeonato de selecciones nacionales de América del Sur.", "label": 3},
      {"text": "El baloncesto es un deporte en el que dos equipos de cinco jugadores intentan anotar puntos lanzando una pelota a través de un aro.", "label": 4},
      {"text": "El aro está colocado a una altura de 3,05 metros del suelo en una tabla rectangular.", "label": 4},
      {"text": "Reglas del Baloncesto: Un partido se juega en cuatro periodos de 10 o 12 minutos cada uno, dependiendo de la liga.", "label": 5},
      {"text": "Los jugadores no pueden caminar con la pelota sin botarla (violación de pasos).", "label": 5},
      {"text": "Un tiro desde fuera de la línea de tres puntos vale tres puntos.", "label": 5},
      {"text": "Jugadores Famosos de Baloncesto: Michael Jordan: Considerado el mejor jugador de baloncesto de todos los tiempos, conocido por sus seis campeonatos de la NBA.", "label": 6},
      {"text": "LeBron James: Jugador destacado de la NBA, conocido por su versatilidad y múltiples campeonatos ganados.", "label": 6},
      {"text": "Kobe Bryant: Conocido por su habilidad para anotar y su ética de trabajo, ganador de cinco campeonatos de la NBA.", "label": 6},
      {"text": "Eventos Importantes de Baloncesto: Juegos Olímpicos: El baloncesto es uno de los deportes destacados en los Juegos Olímpicos.", "label": 7},
      {"text": "NBA Finals: La serie de campeonato de la NBA.", "label": 7},
      {"text": "Campeonato Mundial de Baloncesto: Torneo internacional organizado por la FIBA.", "label": 7},
      {"text": "El tenis es un deporte en el que los jugadores usan raquetas para golpear una pelota sobre una red hacia el campo del oponente.", "label": 8},
      {"text": "Se puede jugar individualmente (uno contra uno) o en parejas (dobles).", "label": 8},
      {"text": "Reglas del Tenis: Un partido se divide en sets, y los sets en juegos.", "label": 9},
      {"text": "El primer jugador en ganar seis juegos con una ventaja de al menos dos juegos gana el set.", "label": 9},
      {"text": "Los puntos se cuentan como 15, 30, 40 y juego, con una ventaja de dos puntos necesaria para ganar un juego.", "label": 9},
      {"text": "Jugadores Famosos de Tenis: Roger Federer: Suizo, considerado uno de los mejores tenistas de todos los tiempos por sus múltiples títulos de Grand Slam.", "label": 10},
      {"text": "Rafael Nadal: Español, conocido por su dominio en pistas de tierra batida y múltiples títulos de Grand Slam.", "label": 10},
      {"text": "Serena Williams: Estadounidense, considerada una de las mejores tenistas femeninas de todos los tiempos.", "label": 10},
      {"text": "Eventos Importantes de Tenis: Wimbledon: El torneo de tenis más antiguo y prestigioso, jugado en césped.", "label": 11},
      {"text": "Abierto de Australia: Uno de los cuatro torneos de Grand Slam, jugado en pista dura.", "label": 11},
      {"text": "Roland Garros: Uno de los cuatro torneos de Grand Slam, jugado en tierra batida.", "label": 11},
      {"text": "El atletismo es un deporte que incluye diversas disciplinas como correr, saltar y lanzar.", "label": 12},
      {"text": "Es uno de los deportes más antiguos y se practica en todo el mundo.", "label": 12},
      {"text": "Reglas del Atletismo: Las competencias de atletismo se dividen en pruebas de pista y campo.", "label": 13},
      {"text": "Las pruebas de pista incluyen carreras de velocidad, medio fondo y fondo.", "label": 13},
      {"text": "Las pruebas de campo incluyen salto de longitud, salto de altura, lanzamiento de peso y jabalina.", "label": 13},
      {"text": "Atletas Famosos de Atletismo: Usain Bolt: Velocista jamaicano, considerado el hombre más rápido del mundo.", "label": 14},
      {"text": "Carl Lewis: Exatleta estadounidense, conocido por sus múltiples medallas olímpicas en carreras y saltos.", "label": 14},
      {"text": "Florence Griffith-Joyner: Exvelocista estadounidense, conocida por sus récords mundiales en 100 y 200 metros.", "label": 14},
      {"text": "Eventos Importantes de Atletismo: Juegos Olímpicos: La competencia más prestigiosa de atletismo, celebrada cada cuatro años.", "label": 15},
      {"text": "Campeonatos Mundiales de Atletismo: Torneo bienal organizado por la IAAF.", "label": 15},
      {"text": "Ligas de Diamante: Serie anual de competiciones de atletismo organizadas por la IAAF.", "label": 15},
      {"text": "El rugby es un deporte de equipo que se juega con una pelota ovalada y dos equipos de quince jugadores cada uno.", "label": 16},
      {"text": "Los jugadores intentan anotar puntos llevando la pelota hasta la zona de gol del equipo contrario o pateando la pelota entre los postes del gol.", "label": 16},
      {"text": "Reglas del Rugby: Un partido de rugby se juega en dos tiempos de 40 minutos cada uno.", "label": 17},
      {"text": "Los equipos intentan anotar puntos llevando la pelota hasta la zona de gol del equipo contrario (ensayo).", "label": 17},
      {"text": "Los equipos también pueden anotar puntos pateando la pelota entre los postes del gol (gol de campo o conversión).", "label": 17},
      {"text": "El equipo con más puntos al final del partido gana.", "label": 17},
      {"text": "Jugadores Famosos de Rugby: Jonah Lomu: Exjugador de rugby neozelandés, conocido por su fuerza y velocidad.", "label": 18},
      {"text": "Martin Johnson: Exjugador de rugby inglés, considerado uno de los mejores delanteros de todos los tiempos.", "label": 18},
      {"text": "Richie McCaw: Exjugador de rugby neozelandés, conocido por su liderazgo y habilidades defensivas.", "label": 18},
      {"text": "Eventos Importantes de Rugby: Copa del Mundo de Rugby: El torneo más prestigioso de rugby, celebrado cada cuatro años.", "label": 19},
      {"text": "Seis Naciones: Torneo anual entre las selecciones nacionales de Inglaterra, Francia, Irlanda, Italia, Escocia y Gales.", "label": 19},
      {"text": "Rugby Championship: Torneo anual entre las selecciones nacionales de Australia, Nueva Zelanda, Sudáfrica y Argentina.", "label": 19},
      {"text": "El boxeo es un deporte de combate en el que dos personas, usando guantes acolchados, se golpean en un ring con el objetivo de debilitar al oponente.", "label": 20},
      {"text": "El boxeo se ha practicado desde tiempos antiguos y es uno de los deportes de combate más populares.", "label": 20},
      {"text": "Reglas del Boxeo: Un combate de boxeo se divide en rounds de tres minutos con un minuto de descanso entre cada round.", "label": 21},
      {"text": "Los boxeadores intentan golpear a su oponente mientras se defienden de los golpes.", "label": 21},
      {"text": "Un combate puede terminar por nocaut, decisión del árbitro o decisión de los jueces.", "label": 21},
      {"text": "El boxeador con más puntos al final del combate gana, a menos que haya un nocaut o decisión del árbitro.", "label": 21},
      {"text": "Boxeadores Famosos: Muhammad Ali: Considerado uno de los mejores boxeadores de todos los tiempos, conocido por su estilo único y sus logros dentro y fuera del ring.", "label": 22},
      {"text": "Mike Tyson: Excampeón de peso pesado, conocido por su poder de golpe y agresividad en el ring.", "label": 22},
      {"text": "Floyd Mayweather Jr.: Exboxeador invicto, conocido por su habilidad defensiva y estrategia en el ring.", "label": 22},
      {"text": "Eventos Importantes de Boxeo: Campeonatos Mundiales: Organizados por diversas asociaciones de boxeo como WBC, WBA, IBF y WBO.", "label": 23},
      {"text": "Juegos Olímpicos: El boxeo es uno de los deportes destacados en los Juegos Olímpicos.", "label": 23},
      {"text": "Peleas de Gran Relevancia: Combates históricos y mediáticos que han capturado la atención del público a nivel mundial.", "label": 23},
      {"text": "El ciclismo es un deporte en el que los participantes utilizan bicicletas para competir en diferentes tipos de carreras.", "label": 24},
      {"text": "El ciclismo se practica tanto en carretera como en pista.", "label": 24},
      {"text": "Tipos de Ciclismo: Ciclismo en carretera: Competencias que se realizan en carreteras pavimentadas.", "label": 25},
      {"text": "Ciclismo en pista: Competencias que se realizan en pistas especialmente diseñadas para el ciclismo.", "label": 25},
      {"text": "Mountain bike: Competencias que se realizan en terrenos naturales y montañosos.", "label": 25},
      {"text": "Ciclismo BMX: Competencias en circuitos con obstáculos y saltos.", "label": 25},
      {"text": "Ciclistas Famosos: Eddy Merckx: Considerado uno de los mejores ciclistas de todos los tiempos, conocido por sus múltiples victorias en el Tour de Francia.", "label": 26},
      {"text": "Lance Armstrong: Conocido por sus victorias en el Tour de Francia, aunque posteriormente descalificado por dopaje.", "label": 26},
      {"text": "Miguel Indurain: Ciclista español, conocido por sus victorias consecutivas en el Tour de Francia.", "label": 26},
      {"text": "Eventos Importantes de Ciclismo: Tour de Francia: La competencia de ciclismo más prestigiosa, realizada anualmente en Francia.", "label": 27},
      {"text": "Giro de Italia: Una de las grandes vueltas del ciclismo, realizada anualmente en Italia.", "label": 27},
      {"text": "Vuelta a España: Una de las grandes vueltas del ciclismo, realizada anualmente en España.", "label": 27},
      {"text": "Campeonatos Mundiales de Ciclismo: Competencia anual organizada por la UCI en diferentes modalidades del ciclismo.", "label": 27},
      {"text": "El golf es un deporte en el que los jugadores usan varios palos para golpear una pelota y meterla en una serie de hoyos en un campo con la menor cantidad de golpes posible.", "label": 28},
      {"text": "El golf se juega en un campo grande y abierto, que generalmente tiene 18 hoyos.", "label": 28},
      {"text": "Reglas del Golf: El objetivo es completar cada hoyo en la menor cantidad de golpes posible.", "label": 29},
      {"text": "Los jugadores alternan turnos para golpear la pelota.", "label": 29},
      {"text": "El jugador con el menor número total de golpes al final de la ronda gana.", "label": 29},
      {"text": "Existen diferentes tipos de palos para diferentes tipos de golpes, como drivers, hierros y putters.", "label": 29},
      {"text": "Golfistas Famosos: Tiger Woods: Considerado uno de los mejores golfistas de todos los tiempos, conocido por sus múltiples victorias en torneos de Grand Slam.", "label": 30},
      {"text": "Jack Nicklaus: Conocido por tener el récord de la mayor cantidad de victorias en torneos de Grand Slam.", "label": 30},
      {"text": "Arnold Palmer: Conocido por su impacto en la popularización del golf y sus múltiples victorias en el PGA Tour.", "label": 30},
      {"text": "Eventos Importantes de Golf: Masters de Augusta: Uno de los torneos de golf más prestigiosos, realizado anualmente en Augusta, Georgia.", "label": 31},
      {"text": "Abierto de los Estados Unidos (US Open): Uno de los cuatro torneos de Grand Slam del golf.", "label": 31},
      {"text": "Abierto Británico (The Open): El torneo de golf más antiguo y uno de los cuatro torneos de Grand Slam.", "label": 31},
      {"text": "Campeonato de la PGA: Uno de los cuatro torneos de Grand Slam del golf.", "label": 31},
      {"text": "El hockey es un deporte en el que dos equipos compiten para meter una pelota o un disco en la portería del equipo contrario usando palos.", "label": 32},
      {"text": "Hay diferentes modalidades de hockey, como el hockey sobre hielo, el hockey sobre césped y el hockey sobre patines.", "label": 32},
      {"text": "Reglas del Hockey sobre Hielo: Un partido se juega en tres periodos de 20 minutos cada uno.", "label": 33},
      {"text": "Los equipos intentan anotar goles metiendo el disco en la portería contraria.", "label": 33},
      {"text": "Se permiten cambios ilimitados de jugadores durante el juego.", "label": 33},
      {"text": "El equipo con más goles al final del partido gana.", "label": 33},
      {"text": "Jugadores Famosos de Hockey sobre Hielo: Wayne Gretzky: Considerado uno de los mejores jugadores de hockey de todos los tiempos, conocido como \"El Gran Uno\".", "label": 34},
      {"text": "Mario Lemieux: Exjugador de hockey canadiense, conocido por su habilidad para anotar y su lucha contra el cáncer.", "label": 34},
      {"text": "Bobby Orr: Exjugador de hockey canadiense, considerado uno de los mejores defensores en la historia del hockey.", "label": 34},
      {"text": "Eventos Importantes de Hockey sobre Hielo: Juegos Olímpicos: El hockey sobre hielo es uno de los deportes destacados en los Juegos Olímpicos de Invierno.", "label": 35},
      {"text": "Campeonato Mundial de Hockey sobre Hielo: Torneo anual organizado por la IIHF.", "label": 35},
      {"text": "Liga Nacional de Hockey (NHL): La liga de hockey sobre hielo más importante del mundo, con equipos de Estados Unidos y Canadá.", "label": 35}
    ]
  }